#include <stdio.h>

int count_numbers(int r) { // функція для обчислення результату
    int a[r+1], b[r+1]; // змінні : два масива
    a[0] = b[0] = 1;
    for (int i = 1; i <= r; i++) {  // a[i] обчислюється як сума a[i-1] (додавання цифри 5 до чисел, що закінчуються на 5)
        a[i] = a[i-1] + b[i-1]; 
        b[i] = a[i-1]; // аналогічно і для b[i]
    }  
    return a[r] + b[r]; // повернення результату
}

int main() {
    int r; // змінна
    scanf("%d", &r); // запитуємо розряд
    printf("%d\n", count_numbers(r)); // виводим результат
    system("pause"); //пауза програми
    exit(1); // примусовий вихід з програми 
}
